uni_spec = {
    # Математика и ИТ
    "01.03.02": "Прикладная математика и информатика",
    "02.03.01": "Математика и компьютерные науки",
    "09.03.01": "Информатика и вычислительная техника",
    "09.03.02": "Информационные системы и технологии",
    "09.03.03": "Прикладная информатика",
    "09.03.04": "Программная инженерия",
    "10.03.01": "Информационная безопасность",

    # Инженерные и технические науки
    "08.03.01": "Строительство",
    "11.03.02": "Инфокоммуникационные технологии и системы связи",
    "13.03.02": "Электроэнергетика и электротехника",
    "15.03.01": "Машиностроение",
    "24.05.01": "Проектирование, производство и эксплуатация ракет и ракетно-космических комплексов",

    # Естественные науки
    "03.03.02": "Физика",
    "04.03.01": "Химия",
    "05.03.06": "Экология и природопользование",
    "06.03.01": "Биология",

    # Общественные науки и экономика
    "38.03.01": "Экономика",
    "38.03.02": "Менеджмент",
    "38.03.05": "Бизнес-информатика",
    "39.03.01": "Социология",
    "40.03.01": "Юриспруденция",
    "41.03.05": "Международные отношения",
    "42.03.01": "Реклама и связи с общественностью",
    "42.03.02": "Журналистика",

    # Гуманитарные науки
    "45.03.01": "Филология",
    "45.03.02": "Лингвистика",
    "46.03.01": "История",

    # Медицина (обычно Специалитет - код .05.)
    "31.05.01": "Лечебное дело",
    "31.05.02": "Педиатрия",
    "31.05.03": "Стоматология"
}